Catalogs/Спецификации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>Спецификации</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Номенклатура</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ХарактеристикаПродукции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаПроизводство</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПроизводства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПроизводства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Недействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоШаблон</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазоваяСпецификация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Спецификации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуетсяРасширение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторСпецификации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипСтрокиСостава</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыСтрокСоставаСпецификации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Comment>Единица измерения</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Спецификация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Спецификации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПродукции</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоляСтоимости</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Этап</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЭтапыПроизводства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФормулаНоменклатура</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФормулаХарактеристика</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФормулаКоличество</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСвязи</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИспользуетсяСопоставление</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Описание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИспользуетсяРасширение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСпецификации</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Операции</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Операция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НормаВремени</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПродукции</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Этап</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЭтапыПроизводства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФормулаОперация</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФормулаКоличество</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФормулаНормаВремени</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСвязи</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИспользуетсяСопоставление</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Описание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СопоставлениеСостава</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КлючСвязи</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РеквизитСопоставления</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеРеквизита</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСтрокиПравил</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СопоставлениеОпераций</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КлючСвязи</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Операция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РеквизитСопоставления</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеРеквизита</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСтрокиПравил</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ФиксированныеЗначения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ФиксированныеЗначенияФормул</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ТипыСтрокСоставаСпецификации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>ТипыСтрокСоставаСпецификации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Материал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сборка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Узел</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расход</Name>
					<Comment>Внешние работы и услуги</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Спецификации/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Установка / снятие основной спецификации
//
// Параметры:
//  Номенклатура	 - 	СправочникСсылка.Номенклатура - Номенклатура, для которой изменяется основная комплектация
//  Характеристика	 - 	СправочникСсылка.ХарактеристикиНоменклатуры - Характеристика, для которой изменяется основная комплектация
//  Спецификация	 - 	СправочникСсылка.Спецификации - Устанавливаемая / снимаемая основная спецификация
//
Процедура ИзменитьПризнакОсновнаяСпецификация(Номенклатура, Характеристика, Спецификация) Экспорт
	
	Менеджер = РегистрыСведений.СпецификацииПоУмолчанию.СоздатьМенеджерЗаписи();
	Менеджер.Номенклатура = Номенклатура;
	Менеджер.Характеристика = Характеристика;
	Менеджер.Прочитать();
	Если Менеджер.Выбран() И Менеджер.Спецификация=Спецификация Тогда
		Менеджер.Удалить();
	Иначе
		ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Спецификация, "ПометкаУдаления, Заказ");
		Если ЗначенияРеквизитов.ПометкаУдаления Тогда
			ТекстСообщения = НСтр("ru = 'Спецификация %1 помечена на удаление. Установка признака <основная> невозможна.'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, Спецификация);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			Возврат;
		КонецЕсли; 
		Если ЗначениеЗаполнено(ЗначенияРеквизитов.Заказ) Тогда
			ТекстСообщения = НСтр("ru = 'Для спецификации заказа установка признака <основная> невозможна.'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, Спецификация);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			Возврат;
		КонецЕсли; 
		Менеджер.Номенклатура = Номенклатура;
		Менеджер.Характеристика = Характеристика;
		Менеджер.Спецификация = Спецификация;
		Менеджер.Записать(Истина);
	КонецЕсли; 
	
КонецПроцедуры

// Возвращает спецификацию по-умолчанию для номенклатуры, характеристики.
// 
// Параметры:
// 	Номенклатура - СправочникСсылка.Номенклатура - номенклатура.
// 	Характеристика - СправочникСсылка.ХарактеристикиНоменклатуры, Неопределено - характеристики.
// 	ВключаяШаблоны - Булево - включая шаблоны.
//
// Возвращаемое значение:
// 	СправочникСсылка.Спецификации - спецификация по-умолчанию.
//
Функция СпецификацияПоУмолчанию(Номенклатура, Характеристика = Неопределено, ВключаяШаблоны = Ложь) Экспорт
	
	Если Не ПравоДоступа("Чтение", Метаданные.Справочники.Спецификации) Тогда
		Возврат Справочники.Спецификации.ПустаяСсылка();
	КонецЕсли;
	
	Если Не ПравоДоступа("Чтение", Метаданные.РегистрыСведений.СпецификацииПоУмолчанию) Тогда
		Возврат Справочники.Спецификации.ПустаяСсылка();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Если Характеристика = Неопределено Тогда
		Запрос.УстановитьПараметр("Характеристика", Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());
	Иначе
		Запрос.УстановитьПараметр("Характеристика",  Характеристика);
	КонецЕсли;
	Запрос.УстановитьПараметр("ВключаяШаблоны", ВключаяШаблоны);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СпецификацииПоУмолчанию.Спецификация КАК Спецификация,
	|	0 КАК Порядок
	|ИЗ
	|	РегистрСведений.СпецификацииПоУмолчанию КАК СпецификацииПоУмолчанию
	|ГДЕ
	|	СпецификацииПоУмолчанию.Номенклатура = &Номенклатура
	|	И СпецификацииПоУмолчанию.Характеристика = &Характеристика
	|	И СпецификацииПоУмолчанию.Спецификация.Владелец = СпецификацииПоУмолчанию.Номенклатура
	|	И СпецификацииПоУмолчанию.Спецификация.ХарактеристикаПродукции = СпецификацииПоУмолчанию.Характеристика
	|	И (&ВключаяШаблоны
	|			ИЛИ НЕ СпецификацииПоУмолчанию.Спецификация.ЭтоШаблон)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СпецификацииПоУмолчанию.Спецификация,
	|	1
	|ИЗ
	|	РегистрСведений.СпецификацииПоУмолчанию КАК СпецификацииПоУмолчанию
	|ГДЕ
	|	СпецификацииПоУмолчанию.Номенклатура = &Номенклатура
	|	И СпецификацииПоУмолчанию.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|	И СпецификацииПоУмолчанию.Спецификация.Владелец = СпецификацииПоУмолчанию.Номенклатура
	|	И СпецификацииПоУмолчанию.Спецификация.ХарактеристикаПродукции = СпецификацииПоУмолчанию.Характеристика
	|	И (&ВключаяШаблоны
	|			ИЛИ НЕ СпецификацииПоУмолчанию.Спецификация.ЭтоШаблон)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Спецификация;
	Иначе
		Возврат Справочники.Спецификации.ПустаяСсылка();
	КонецЕсли; 
	
КонецФункции

// Возвращает спецификацию по-умолчанию для номенклатуры, характеристики.
// 
// Параметры:
// 	Заказ - ДокументСсылка.ЗаказПокупателя - заказ.
// 	Номенклатура - СправочникСсылка.Номенклатура - номенклатура.
// 	Характеристика - СправочникСсылка.ХарактеристикиНоменклатуры - характеристики.
//
// Возвращаемое значение:
// 	СправочникСсылка.Спецификации - спецификация заказа.
//
Функция СпецификацияЗаказа(Заказ, Номенклатура, Характеристика) Экспорт
	
	Если Не ПравоДоступа("Чтение", Метаданные.Справочники.Спецификации) Тогда
		Возврат Справочники.Спецификации.ПустаяСсылка();
	КонецЕсли;
	
	Если Не ПравоДоступа("Чтение", Метаданные.РегистрыСведений.СпецификацииПоУмолчанию) Тогда
		Возврат Справочники.Спецификации.ПустаяСсылка();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Номенклатура", 	Номенклатура);
	Запрос.УстановитьПараметр("Характеристика", Характеристика);
	Запрос.УстановитьПараметр("Заказ", 			Заказ);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 2
	|	СпецификацииПоУмолчанию.Ссылка КАК Спецификация
	|ИЗ
	|	Справочник.Спецификации КАК СпецификацииПоУмолчанию
	|ГДЕ
	|	СпецификацииПоУмолчанию.Заказ = &Заказ
	|	И СпецификацииПоУмолчанию.Владелец = &Номенклатура
	|	И СпецификацииПоУмолчанию.ХарактеристикаПродукции = &Характеристика";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() 
		И Выборка.Количество() = 1 Тогда
		
		Возврат Выборка.Спецификация;
		
	Иначе
		Возврат Справочники.Спецификации.ПустаяСсылка();
	КонецЕсли; 
	
КонецФункции

// Функция возвращает шаблон процедуры подключаемого показателя
//
// Параметры:
//  ИдентификаторСпецификации	 - Строка	 - Идентификатор спецификации для поиска
// 
// Возвращаемое значение:
//  Строка - Шаблон подключаемой процедуры
//
Функция ШаблонПроцедурыПодключаемойПозиции(ИдентификаторСпецификации) Экспорт
	
	ШаблонПроцедуры = 
		НСтр("ru = '// Процедура заполняет Спецификацию
		|//
		|// Параметры:
		|//  СтрокаТаблицыЗначений		- Строка таблицы значений	 - Строка спецификации которая рассчитывается по данным расширения
		|//	 Данные 					- Соответствие - содержит данные: 
		|// 	*ЗаказНаПроизводство
		|// 	*ЗаказПокупателя
		|// 	*Строка таблицы продукции
		|// 	*Характеристика продукции
		|// 	*Спецификация продукции 
		|// 	*Ключ связи
		|// Возвращаемое значение:
		|//  СтруктураРеквизитов	 	- Структура	 - Структура для помещения результата, на основе данной структуры заполняется строка спецификации. Рекомендуемые значения:
		|//   * Номенклатура			- СправочникСсылка.Номенклатура - Номенклатура спецификации
		|//   * Характеристика		 	- СправочникСсылка.ХарактеристикиНоменклатуры - Характеристика номенклатуры спецификации
		|//   * Единица измерения		- СправочникСсылка.КлассификаторЕдиницИзмерения, СправочникСсылка.ЕдиницыИзмерения - Единица измерения номенклатуры характеристики
		|//  Так же можно заполнить и другие поля строки состава спецификации
		|//
		|Процедура ПолучитьРасшифровкуПоказателя_%1(СтрокаТаблицыЗначений,СтруктураРеквизитов, Данные) Экспорт
		|	// Вставить содержимое процедуры.
		|КонецПроцедуры'");
	
	АдаптированныйИдентификатор = СтрЗаменить(ИдентификаторСпецификации, "-", "_");
	АдаптированныйИдентификатор = СтрЗаменить(АдаптированныйИдентификатор," ","");
	ШаблонПроцедуры = СтрШаблон(ШаблонПроцедуры, АдаптированныйИдентификатор);
	
	Возврат ШаблонПроцедуры;
	
КонецФункции
#КонецОбласти

#Область ОбработчикиСобытий

// Процедура обработчик события ОбработкаПолученияДанныхВыбора.
//
Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Отказ = Ложь;
	ПроизводствоСервер.ДобавитьОтборыСпецификации(Параметры, Отказ);
	
КонецПроцедуры // ОбработкаПолученияДанныхВыбора()

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// Определяет список команд заполнения.
//
// Параметры:
//   КомандыЗаполнения - ТаблицаЗначений - Таблица с командами заполнения. Для изменения.
//       См. описание 1 параметра процедуры ЗаполнениеОбъектовПереопределяемый.ПередДобавлениемКомандЗаполнения().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры ЗаполнениеОбъектовПереопределяемый.ПередДобавлениемКомандЗаполнения().
//
Процедура ДобавитьКомандыЗаполнения(КомандыЗаполнения, Параметры) Экспорт
	
КонецПроцедуры

// Функция - Шаблон процедуры подключаемой спецификации
//
// Параметры:
//  ИдентификаторСпецификации	 - Строка - идентификатор спецификации
// 
// Возвращаемое значение:
//  Строка - шаблон процедуры
//
Функция ШаблонПроцедурыПодключаемойСпецификации(ИдентификаторСпецификации) Экспорт
	
	// АПК:1299-выкл проектное решение
	ШаблонПроцедуры = 
		НСтр("ru = '
		|// Процедура заполняет данные по спецификации из расширения
		|//
		|// Параметры:
		|//  ИзменяемыеДанные - Соответсвие:
		|//     * Состав - соответвие - Данные содержат ключи и значения измененных параметрических данных спецификации табличной части Состав
		|//     * Операции  - соответвие - Данные содержат ключи и значения измененных параметрических данных спецификации табличной части Операции
		|//  Спецификация - СправочникСсылка.Спецификации - Ссылка на саму спецификацию
		|//  Данные - соответвие - Данные контекста заполнения (Заказ покупателя, заказ на производство, спецификация) 
		|//
		|Процедура ПолучитьРасшифровкуПодключаемойСпецификации_%1(ИзменяемыеДанные,Спецификация,Данные) Экспорт
		|	
		|	// Вставить содержимое процедуры.
		|	
		|КонецПроцедуры'");
	// АПК:1299-вкл
	
	АдаптированныйИдентификатор = СтрЗаменить(ИдентификаторСпецификации, "-", "_");
	ШаблонПроцедуры = СтрШаблон(ШаблонПроцедуры, АдаптированныйИдентификатор);
	
	Возврат ШаблонПроцедуры;
	
КонецФункции
#КонецОбласти

#Область ЗагрузкаДанныхИзВнешнегоИсточника

Процедура ОбработатьПодготовленныеДанные(СтруктураДанных, ФоновоеЗаданиеАдресХранилища = "") Экспорт
	
	ФОУчетГТД						= ПолучитьФункциональнуюОпцию("УчетГТД");
	НастройкиОбновленияСвойств		= СтруктураДанных.НастройкиЗагрузкиДанных.НастройкиОбновленияСвойств;
	ОбновлятьСуществующие			= СтруктураДанных.НастройкиЗагрузкиДанных.ОбновлятьСуществующие;
	СоздаватьЕслиНеСопоставлено		= СтруктураДанных.НастройкиЗагрузкиДанных.СоздаватьЕслиНеСопоставлено;
	ФиксированныйШаблон				= СтруктураДанных.НастройкиЗагрузкиДанных.ФиксированныйШаблон;
	ТаблицаСопоставленияДанных		= СтруктураДанных.ТаблицаСопоставленияДанных;
	РазмерТаблицыДанных				= ТаблицаСопоставленияДанных.Количество();
	НастройкиЗагрузкиДанных			= СтруктураДанных.НастройкиЗагрузкиДанных;
	КоличествоЗаписейТранзакции		= 0;
	ТранзакцияОткрыта				= Ложь;
	
	Если НЕ НастройкиЗагрузкиДанных.Свойство("НастройкиОбновленияСвойств") Тогда
		НастройкиЗагрузкиДанных.Вставить("НастройкиОбновленияСвойств", НастройкиОбновленияСвойств);  
	КонецЕсли;
	
	ВременныеДанныеЗагрузки = Новый Структура;
	ВременныеДанныеЗагрузки.Вставить("СозданныеГруппы", Новый Соответствие);
		
	Если ФОУчетГТД Тогда
		ТаблицаКлассификатораТНВЭД = Справочники.КлассификаторТНВЭД.ТаблицаКлассификатораТНВЭД();
		ВременныеДанныеЗагрузки.Вставить("ТаблицаКлассификатораТНВЭД", ТаблицаКлассификатораТНВЭД);
	КонецЕсли;
	
	Если ФиксированныйШаблон Тогда
		
		ВводНачальныхОстатков = Документы.ВводНачальныхОстатков.СоздатьДокумент();
		ВводНачальныхОстатков.Дата 			= НачалоДня(ТекущаяДатаСеанса());
		ВводНачальныхОстатков.Организация 	= Справочники.Организации.ОрганизацияПоУмолчанию();
		ВводНачальныхОстатков.РазделУчета 	= Перечисления.РазделыУчета.Запасы;
		
		ВременныеДанныеЗагрузки.Вставить("ВводНачальныхОстатков", ВводНачальныхОстатков);
		
	КонецЕсли;  
	
	Если НЕ ТранзакцияОткрыта 
		И КоличествоЗаписейТранзакции = 0 Тогда
		
		НачатьТранзакцию();
		ТранзакцияОткрыта = Истина;
		
	КонецЕсли;

	Попытка
		
		Для Каждого СтрокаТаблицы Из ТаблицаСопоставленияДанных Цикл
						
			ЗагрузкаВПриложениеВозможна = СтрокаТаблицы[ЗагрузкаДанныхИзВнешнегоИсточника.ИмяСлужебногоПоляЗагрузкаВПриложениеВозможна()];
			
			МожноЗагрузитьИлиОбновить = (СтрокаТаблицы._СтрокаСопоставлена И ОбновлятьСуществующие) 
				ИЛИ (НЕ СтрокаТаблицы._СтрокаСопоставлена И СоздаватьЕслиНеСопоставлено)
				ИЛИ ФиксированныйШаблон;
			
			Если ЗагрузкаВПриложениеВозможна И МожноЗагрузитьИлиОбновить Тогда
				
				ВременныеДанныеЗагрузки.Вставить("СоздатьСоответствиеЕГАИС", Ложь);
				КоличествоЗаписейТранзакции = КоличествоЗаписейТранзакции + 1;
				
				Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.Номенклатура) Тогда	
							 
					ЭлементСправочника = ЗагрузитьЭлементСправочникаНоменклатура(СтрокаТаблицы, СтруктураДанных, ВременныеДанныеЗагрузки);	
					
					Справочники.Номенклатура.ЗагрузитьСвязанныеДанные(ЭлементСправочника, СтрокаТаблицы, 
						НастройкиЗагрузкиДанных, ВременныеДанныеЗагрузки);
						
				КонецЕсли;
				
			КонецЕсли;
			
			ИндексТекущейСтроки	= ТаблицаСопоставленияДанных.Индекс(СтрокаТаблицы);
			ТекстПрогресса		= СтрШаблон(НСтр("ru ='Обработано %1 из %2 строк...'"), ИндексТекущейСтроки, РазмерТаблицыДанных);
			
			ДлительныеОперации.СообщитьПрогресс(, ТекстПрогресса);
			
			Если ТранзакцияОткрыта
				И КоличествоЗаписейТранзакции > ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.МаксимумЗаписейВОднойТранзакции() Тогда
				
				ЗафиксироватьТранзакцию();
				ТранзакцияОткрыта = Ложь;
				КоличествоЗаписейТранзакции = 0;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если ТранзакцияОткрыта 
			И КоличествоЗаписейТранзакции > 0 Тогда
			
			ЗафиксироватьТранзакцию();
			ТранзакцияОткрыта = Ложь;
			
		КонецЕсли;
		
	Исключение
		
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		НастройкиЗагрузкиДанных.Вставить("ТекстОшибки", ТекстОшибки);
		
		ЗаписьЖурналаРегистрации(НСтр("ru='Загрузка данных'", "ru"), УровеньЖурналаРегистрации.Ошибка, 
			Метаданные.Справочники.Номенклатура, , ТекстОшибки); 
			
		ОтменитьТранзакцию();
		Возврат;
		
	КонецПопытки;
	
	Если ТранзакцияОткрыта Тогда
		ЗафиксироватьТранзакцию();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ФоновоеЗаданиеАдресХранилища) Тогда   
		
		МассивСопоставленияДанных = ОбщегоНазначения.ТаблицаЗначенийВМассив(ТаблицаСопоставленияДанных);
		
		СтруктураРезультата = Новый Структура;
		СтруктураРезультата.Вставить("МассивСопоставленияДанных"	, МассивСопоставленияДанных); 
		СтруктураРезультата.Вставить("НастройкиЗагрузкиДанных"		, НастройкиЗагрузкиДанных); 
		СтруктураРезультата.Вставить("ФоновоеЗаданиеАдресХранилища"	, ФоновоеЗаданиеАдресХранилища); 
					
		ПоместитьВоВременноеХранилище(СтруктураРезультата, ФоновоеЗаданиеАдресХранилища);
	КонецЕсли;

КонецПроцедуры   

Функция ПроверитьИУдалитьНеиспользуемыеИменаПолейНоменклатуры(СтруктураДанных) Экспорт  
	
	ОбновленныеНастройкиЗагрузкиДанных 	= СтруктураДанных.НастройкиЗагрузкиДанных;	
	ИсходныеНастройкиЗагрузкиДанных 	= СтруктураДанных.НастройкиЗагрузкиДанных;
	
	Если ИсходныеНастройкиЗагрузкиДанных.Свойство("НастройкиОбновленияСвойств") Тогда
			
		Если ИсходныеНастройкиЗагрузкиДанных.НастройкиОбновленияСвойств.Свойство("ИменаПолейОбновляемые") Тогда 
			
			ИменаПолейОбновляемые = "Артикул,СчетУчетаДоходов,СчетУчетаЗапасов,СчетУчетаЗатрат,КатегорияНоменклатуры"; 
			
			ИменаПолей = ЗагрузкаДанныхИзВнешнегоИсточника.УдалитьНесуществующиеСвойства(
				СтрРазделить(ИменаПолейОбновляемые, ", "), 
					Метаданные.Справочники.Номенклатура.Реквизиты);

			ОбновленныеНастройкиЗагрузкиДанных.НастройкиОбновленияСвойств.ИменаПолейОбновляемые = ИменаПолей;   
				
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ОбновленныеНастройкиЗагрузкиДанных;
	
КонецФункции

Функция ЗагрузитьЭлементСправочникаНоменклатура(СтрокаТаблицы, СтруктураДанных, ВременныеДанныеЗагрузки) 
	
	ОбновленныеНастройкиЗагрузкиДанных = ПроверитьИУдалитьНеиспользуемыеИменаПолейНоменклатуры(СтруктураДанных);
	СтруктураДанных.НастройкиЗагрузкиДанных = ОбновленныеНастройкиЗагрузкиДанных;
	
	Возврат Справочники.Номенклатура.ЗагрузитьЭлемент(СтрокаТаблицы, СтруктураДанных, ВременныеДанныеЗагрузки);	
	
КонецФункции

Функция ПустаяТаблицаДублирующихСтрок()
			
	Возврат ЗагрузкаДанныхИзВнешнегоИсточника.ПустаяТаблицаДублирующихСтрокНоменклатуры();
	
КонецФункции

// Поля загрузки данных из внешнего источника.
// 
// Параметры:
//  ТаблицаПолейЗагрузки - см. ЗагрузкаДанныхИзВнешнегоИсточника.СоздатьТаблицуПолейОписанияЗагрузки
//  НастройкиЗагрузкиДанных - см. ЗагрузкаДанныхИзВнешнегоИсточника.ПриСозданииНаСервере
//
Процедура ПоляЗагрузкиДанныхИзВнешнегоИсточника(ТаблицаПолейЗагрузки, НастройкиЗагрузкиДанных) Экспорт

	ОписанияТиповПолей = ЗагрузкаДанныхИзВнешнегоИсточника.НовыйОписанияТиповПолейЗагрузки();

	ОписаниеТиповКолонка = Новый ОписаниеТипов("ПеречислениеСсылка.ТипыСтрокСоставаСпецификации");
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "ТипСтрокиСостава", НСтр(
		"ru = 'Тип строки'"), ОписанияТиповПолей.ОписаниеТиповСтрока25, ОписаниеТиповКолонка);

	ОписаниеТиповКолонка = Новый ОписаниеТипов("СправочникСсылка.Номенклатура");
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПоляНоменклатуры(ТаблицаПолейЗагрузки, ОписаниеТиповКолонка,
		ОписанияТиповПолей, НастройкиЗагрузкиДанных);

	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПоляХарактеристики(ТаблицаПолейЗагрузки, ОписанияТиповПолей);

	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Количество", НСтр(
		"ru = 'Количество'"), ОписанияТиповПолей.ОписаниеТиповСтрока25, ОписанияТиповПолей.ОписаниеТиповЧисло15_3, , ,
		Истина);

	ОписаниеТиповКолонка = Новый ОписаниеТипов("СправочникСсылка.КлассификаторЕдиницИзмерения, СправочникСсылка.ЕдиницыИзмерения");
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "ЕдиницаИзмерения", НСтр(
		"ru = 'Ед. изм.'"), ОписанияТиповПолей.ОписаниеТиповСтрока25, ОписаниеТиповКолонка);

	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "ДоляСтоимости", НСтр(
		"ru = 'Доля стоимости'"), ОписанияТиповПолей.ОписаниеТиповСтрока25, ОписанияТиповПолей.ОписаниеТиповЧисло15_2);

	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "КоличествоПродукции", НСтр(
		"ru = 'Количество продукции'"), ОписанияТиповПолей.ОписаниеТиповСтрока25,
		ОписанияТиповПолей.ОписаниеТиповЧисло15_3);

	ОписаниеТиповКолонка = Новый ОписаниеТипов("СправочникСсылка.Спецификации");
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Спецификация", НСтр(
		"ru = 'Спецификация (наименование)'"), ОписанияТиповПолей.ОписаниеТиповСтрока100, ОписаниеТиповКолонка);

КонецПроцедуры

Процедура ПриОпределенииОбразцовЗагрузкиДанных(НастройкиЗагрузкиДанных, УникальныйИдентификатор) Экспорт
	
	Образец_csv = ПолучитьМакет("ОбразецЗагрузкиДанных_csv");
	ОбразецЗагрузкиДанных_csv = ПоместитьВоВременноеХранилище(Образец_csv, УникальныйИдентификатор);
	НастройкиЗагрузкиДанных.Вставить("ОбразецЗагрузкиДанных_csv", ОбразецЗагрузкиДанных_csv);
	
	НастройкиЗагрузкиДанных.Вставить("ОбразецЗагрузкиДанных_mxl", "ОбразецЗагрузкиДанных_mxl");
	
	Образец_xlsx = ПолучитьМакет("ОбразецЗагрузкиДанных_xlsx");
	ОбразецЗагрузкиДанных_xlsx = ПоместитьВоВременноеХранилище(Образец_xlsx, УникальныйИдентификатор);
	НастройкиЗагрузкиДанных.Вставить("ОбразецЗагрузкиДанных_xlsx", ОбразецЗагрузкиДанных_xlsx);
	
КонецПроцедуры

// АПК:299-выкл процедура вызывается программно в форме ПомощникЗагрузкиДанныхИзВнешнегоИсточника обработки ЗагрузкаДанныхИзВнешнегоИсточника

Процедура СопоставитьЗагружаемыеДанныеИзВнешнегоИсточника(ПараметрыСопоставления, АдресРезультата) Экспорт
	
	ТаблицаСопоставленияДанных	= ПараметрыСопоставления.ТаблицаСопоставленияДанных;
	РазмерТаблицыДанных			= ТаблицаСопоставленияДанных.Количество();
	НастройкиЗагрузкиДанных		= ПараметрыСопоставления.НастройкиЗагрузкиДанных;
	НастройкиПоиска				= НастройкиЗагрузкиДанных.НастройкиПоиска;
	ТаблицаДублирующихСтрок		= ПустаяТаблицаДублирующихСтрок();
	
	НастройкиПоиска.Вставить("ТаблицаДублирующихСтрок", ТаблицаДублирующихСтрок);
	
	// ТаблицаСопоставленияДанных - Тип ДанныеФормыКоллекция
	Для каждого СтрокаТаблицыФормы Из ТаблицаСопоставленияДанных Цикл
		
		// Номенклатура по ШтрихКоду, Артикулу, Наименованию
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СопоставитьНоменклатуру(СтрокаТаблицыФормы, НастройкиПоиска);
		
		// ТипСтроки по ТипСтроки.Наименование
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СопоставитьТипСтроки(СтрокаТаблицыФормы.ТипСтрокиСостава, СтрокаТаблицыФормы.ТипСтрокиСостава_ВходящиеДанные, Перечисления.ТипыСтрокСоставаСпецификации.Материал);
		
		Если ПолучитьФункциональнуюОпцию("ИспользоватьХарактеристики") Тогда
			
			Если ЗначениеЗаполнено(СтрокаТаблицыФормы.Номенклатура) Тогда
				
				// Характеристика по Владельцу, Наименованию и Артикулу
				ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СопоставитьХарактеристику(СтрокаТаблицыФормы);
				
			КонецЕсли;
			
		КонецЕсли;
		
		// Количество
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.ПреобразоватьСтрокуВЧисло(СтрокаТаблицыФормы.Количество, СтрокаТаблицыФормы.Количество_ВходящиеДанные, 1);
		
		// ЕдиницыИзмерения по Наименованию 
		ЗначениеПоУмолчанию = ?(ЗначениеЗаполнено(СтрокаТаблицыФормы.Номенклатура), СтрокаТаблицыФормы.Номенклатура.ЕдиницаИзмерения, Справочники.КлассификаторЕдиницИзмерения.шт);
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СопоставитьЕдиницыИзмерения(СтрокаТаблицыФормы.Номенклатура, СтрокаТаблицыФормы.ЕдиницаИзмерения, СтрокаТаблицыФормы.ЕдиницаИзмерения_ВходящиеДанные, ЗначениеПоУмолчанию);
		
		// Доля стоимости
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.ПреобразоватьСтрокуВЧисло(СтрокаТаблицыФормы.ДоляСтоимости, СтрокаТаблицыФормы.ДоляСтоимости_ВходящиеДанные, 1);
		
		// Количество продукции
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.ПреобразоватьСтрокуВЧисло(СтрокаТаблицыФормы.КоличествоПродукции, СтрокаТаблицыФормы.КоличествоПродукции_ВходящиеДанные, 1);
		
		// Спецификации по владельцу, наименованию
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СопоставитьСпецификацию(СтрокаТаблицыФормы.Спецификация, СтрокаТаблицыФормы.Спецификация_ВходящиеДанные, СтрокаТаблицыФормы.Номенклатура);
		
		ПроверитьКорректностьДанныхВСтрокеТаблицы(СтрокаТаблицыФормы);
		
		ЗагрузкаДанныхИзВнешнегоИсточника.ПрогрессСопоставленияДанных(ТаблицаСопоставленияДанных.Индекс(СтрокаТаблицыФормы), РазмерТаблицыДанных);
		
	КонецЦикла;
	
	ТаблицаСопоставленияДанных.ЗагрузитьКолонку(ТаблицаДублирующихСтрок.ВыгрузитьКолонку("КлючСвязи"), "_КлючСвязи");

	ПоместитьВоВременноеХранилище(ТаблицаСопоставленияДанных, АдресРезультата);
	
КонецПроцедуры

// АПК:299-вкл

Процедура ПроверитьКорректностьДанныхВСтрокеТаблицы(СтрокаТаблицыФормы, ПолноеИмяОбъектаЗаполнения = "") Экспорт
	
	ИмяСлужебногоПоля = ЗагрузкаДанныхИзВнешнегоИсточника.ИмяСлужебногоПоляЗагрузкаВПриложениеВозможна();
	
	НоменклатураЗаполнена = ЗначениеЗаполнено(СтрокаТаблицыФормы.Номенклатура);
	ЗагрузкаНоменклатурыВозможна = Ложь;
	Если НЕ НоменклатураЗаполнена Тогда
		ЗагрузкаНоменклатурыВозможна = (ЗначениеЗаполнено(СтрокаТаблицыФормы.НоменклатураНаименование) ИЛИ ЗначениеЗаполнено(СтрокаТаблицыФормы.НоменклатураНаименованиеПолное));
	КонецЕсли;
	
	СтрокаТаблицыФормы._СтрокаСопоставлена = НоменклатураЗаполнена;
	
	Если НоменклатураЗаполнена Тогда			
		
		СтрокаТаблицыФормы[ИмяСлужебногоПоля] = Не СтрокаТаблицыФормы.Номенклатура.ЭтоНабор // Исключая наборы 
			И (СтрокаТаблицыФормы.Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Запас
			   Или СтрокаТаблицыФормы.Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга)
			И СтрокаТаблицыФормы.Количество <> 0;		
		
	Иначе
		
		СтрокаТаблицыФормы[ИмяСлужебногоПоля] = ЗагрузкаНоменклатурыВозможна;
			
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ГрупповаяОбработка

// Возвращает список реквизитов, которые разрешается редактировать
// с помощью обработки группового изменения объектов.
//
// Возвращаемое значение:
// 	Массив - реквизиты, которые разрешается редактировать в обработке группового изменения.
//
Функция РеквизитыРедактируемыеВГрупповойОбработке() Экспорт
	
	РедактируемыеРеквизиты = Новый Массив;
	
	РедактируемыеРеквизиты.Добавить("Владелец");
	РедактируемыеРеквизиты.Добавить("ХарактеристикаПродукции");
	РедактируемыеРеквизиты.Добавить("ВидПроизводства");
	РедактируемыеРеквизиты.Добавить("Заказ");
	РедактируемыеРеквизиты.Добавить("Комментарий");
	РедактируемыеРеквизиты.Добавить("Недействителен");
	
	Возврат РедактируемыеРеквизиты;
	
КонецФункции

#КонецОбласти 

#Область ВерсионированиеОбъектов

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#КонецОбласти

#Область ИнтерфейсПечати

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Спецификация";
	КомандаПечати.Представление = НСтр("ru = 'Спецификация'");
	КомандаПечати.СписокФорм = "ФормаЭлемента,ФормаСписка,ФормаВыбора";
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Порядок = 4;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "СпецификацияРазвернуто";
	КомандаПечати.Представление = НСтр("ru = 'Спецификация (развернуто)'");
	КомандаПечати.СписокФорм = "ФормаЭлемента,ФормаСписка,ФормаВыбора";
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Порядок = 8;
	
КонецПроцедуры

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов - Массив - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр)
//  ОбъектыПечати - СписокЗначений - значение - ссылка на объект;
//                                            представление - имя области, в которой был выведен объект (выходной параметр);
//  ПараметрыВывода - Структура - дополнительные параметры сформированных табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	Перем Ошибки;
	
	ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "Спецификация");
	Если ПечатнаяФорма <> Неопределено Тогда
		
		ПечатнаяФорма.ТабличныйДокумент = Новый ТабличныйДокумент;
		ПечатнаяФорма.ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Спецификации_Спецификация";
		ПечатнаяФорма.ПолныйПутьКМакету = "Справочник.Спецификации.ПФ_MXL_Спецификация";
		ПечатнаяФорма.СинонимМакета = НСтр("ru ='Спецификация'");
		
		СформироватьСпецификацию(ПечатнаяФорма, МассивОбъектов, ОбъектыПечати, Ошибки);
		
	КонецЕсли;
	
	ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "СпецификацияРазвернуто");
	Если ПечатнаяФорма <> Неопределено Тогда
		
		ПечатнаяФорма.ТабличныйДокумент = Новый ТабличныйДокумент;
		ПечатнаяФорма.ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Спецификации_СпецификацияРазвернуто";
		ПечатнаяФорма.ПолныйПутьКМакету = "Справочник.Спецификации.ПФ_MXL_Спецификация";
		ПечатнаяФорма.СинонимМакета = НСтр("ru ='Спецификация (развернуто)'");
		
		СформироватьСпецификацию(ПечатнаяФорма, МассивОбъектов, ОбъектыПечати, Ошибки, Истина);
		
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки);
	
	// параметры отправки печатных форм по электронной почте
	ЭлектроннаяПочтаУНФ.ЗаполнитьПараметрыОтправки(ПараметрыВывода.ПараметрыОтправки, МассивОбъектов, 
		КоллекцияПечатныхФорм);
	
КонецПроцедуры

#КонецОбласти 

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

#Область ИнтерфейсПечати

Процедура СформироватьСпецификацию(ПечатнаяФорма, МассивОбъектов, ОбъектыПечати, Ошибки, Развернуто = Ложь)
	Перем ПервыйДокумент, НомерСтрокиНачало;
	
	ДанныеПечати = Новый Структура;
	ТабличныйДокумент = ПечатнаяФорма.ТабличныйДокумент;
	Макет = УправлениеПечатью.МакетПечатнойФормы(ПечатнаяФорма.ПолныйПутьКМакету);
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.Текст = ТекстЗапросаПечатьСпецификации();
	ТаблицаСпецификаций = Запрос.Выполнить().Выгрузить();
	
	ОрганизацияПоУмолчанию = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(
		Пользователи.ТекущийПользователь(),
		"ОсновнаяОрганизация");
	Если НЕ ЗначениеЗаполнено(ОрганизацияПоУмолчанию) Тогда
		ЗапросОрганизация = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Организации.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Организации КАК Организации
		|ГДЕ
		|	Организации.ИмяПредопределенныхДанных = ""ОсновнаяОрганизация""
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	Организации.Ссылка
		|ИЗ
		|	Справочник.Организации КАК Организации");
		Выборка = ЗапросОрганизация.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ОрганизацияПоУмолчанию = Выборка.Ссылка;
		КонецЕсли;
	КонецЕсли;
	
	Для каждого Шапка Из ТаблицаСпецификаций Цикл
		
		Если ЗначениеЗаполнено(Шапка.Организация) Тогда
			ОрганизацияСпецификации = Шапка.Организация;
		Иначе
			ОрганизацияСпецификации = ОрганизацияПоУмолчанию;
		КонецЕсли; 
		СведенияОбОрганизации = ПечатьДокументовУНФ.СведенияОЮрФизЛице(ОрганизацияСпецификации, ТекущаяДатаСеанса());
		ПредставлениеПоставщика = ПечатьДокументовУНФ.ОписаниеОрганизации(
			СведенияОбОрганизации, 
			"ПолноеНаименование,ИНН,КПП,ЮридическийАдрес,Телефоны,");
		
		Если Развернуто Тогда
			РазвернутьСпецификации(Шапка);
		КонецЕсли;
		Если Шапка.Состав.Количество() = 0 И Шапка.Операции.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Шапка.ВидПроизводства) Тогда
			// Группировка по этапам
			ПорядокЭтапов = Новый Соответствие;
			Для каждого СтрокаЭтап Из Шапка.Этапы Цикл
				ПорядокЭтапов.Вставить(СтрокаЭтап.этап, СтрокаЭтап.НомерСтроки);
			КонецЦикла;
			Для каждого СтрокаСостава Из Шапка.Состав Цикл
				Если НЕ ЗначениеЗаполнено(СтрокаСостава.Этап) Тогда
					Продолжить;
				КонецЕсли; 
				СтрокаСостава.Порядок = ПорядокЭтапов.Получить(СтрокаСостава.Этап);
			КонецЦикла; 
			Для каждого СтрокаОперации Из Шапка.Операции Цикл
				Если НЕ ЗначениеЗаполнено(СтрокаОперации.Этап) Тогда
					Продолжить;
				КонецЕсли; 
				СтрокаОперации.Порядок = ПорядокЭтапов.Получить(СтрокаОперации.Этап);
			КонецЦикла;
		Иначе
			Для каждого СтрокаСостав Из Шапка.Состав Цикл
				СтрокаСостав.Порядок = 0;
			КонецЦикла; 
			Для каждого СтрокаОперации Из Шапка.Операции Цикл
				СтрокаОперации.Порядок = 0;
			КонецЦикла; 
		КонецЕсли; 
		Шапка.Состав.Сортировать("Порядок, НомерСтроки");
		Шапка.Операции.Сортировать("Порядок, НомерСтроки");
		
		ПечатьДокументовУНФ.ПередНачаломФормированияДокумента(ТабличныйДокумент, ПервыйДокумент, НомерСтрокиНачало);
		
		ТекстЗаголовка = СтрШаблон(НСтр("ru='Спецификация ""%1""'"), Шапка.Наименование);
		
		ДанныеПечати.Очистить();
		ДанныеПечати.Вставить("ТекстЗаголовка", ТекстЗаголовка);
		ДанныеПечати.Вставить("ПредставлениеПоставщика", ПредставлениеПоставщика);
		
		ПараметрыНоменклатуры = Новый Структура;
		ПараметрыНоменклатуры.Вставить("ПредставлениеНоменклатуры", Шапка.Номенклатура);
		ПараметрыНоменклатуры.Вставить("ПредставлениеХарактеристики", Шапка.Характеристика);
		ПараметрыНоменклатуры.Вставить("ПредставлениеАртикула", Шапка.Артикул);
		ДанныеПечати.Вставить("ПредставлениеНоменклатуры", ПечатьДокументовУНФ.ПредставлениеНоменклатуры(ПараметрыНоменклатуры));
		
		ВывестиЗаголовок(ТабличныйДокумент, Макет, ДанныеПечати);
		
		Если ЗначениеЗаполнено(Шапка.Заказ) Тогда
			ДанныеПечати.Очистить();
			Если ТипЗнч(Шапка.Заказ)=Тип("ДокументСсылка.ЗаказПокупателя") Тогда
				ДанныеПечати.Вставить("ПредставлениеЗаказа", СтрШаблон("%1 (%2)", Шапка.Заказ, Шапка.Контрагент));
			Иначе
				ДанныеПечати.Вставить("ПредставлениеЗаказа", Строка(Шапка.Заказ));
			КонецЕсли; 
			ВывестиЗаказ(ТабличныйДокумент, Макет, ДанныеПечати);
		КонецЕсли; 
		
		ВывестиТаблицу(Шапка.Состав, ТабличныйДокумент, Макет, "Состав");
		ВывестиТаблицу(Шапка.Операции, ТабличныйДокумент, Макет, "Операции");
		ВывестиПодписи(ТабличныйДокумент, Макет);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
		
	КонецЦикла;
	
	ТабличныйДокумент.ОтображатьГруппировки = Истина;
	
КонецПроцедуры

Функция ТекстЗапросаПечатьСпецификации()
		
	Возврат "ВЫБРАТЬ
	        |	Спецификации.Ссылка КАК Ссылка,
	        |	Спецификации.Наименование КАК Наименование,
	        |	Спецификации.Владелец КАК Номенклатура,
	        |	Спецификации.ХарактеристикаПродукции КАК Характеристика,
	        |	Спецификации.Владелец.Артикул КАК Артикул,
	        |	Спецификации.Владелец.Штрихкод КАК Штрихкод,
	        |	Спецификации.Заказ КАК Заказ,
	        |	ВЫБОР
	        |		КОГДА Спецификации.Заказ = НЕОПРЕДЕЛЕНО
	        |			ТОГДА ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	        |		ИНАЧЕ Спецификации.Заказ.Организация
	        |	КОНЕЦ КАК Организация,
	        |	Спецификации.Состав.(
	        |		ВЫБОР
	        |			КОГДА Спецификации.ВидПроизводства = ЗНАЧЕНИЕ(Справочник.ВидыПроизводства.ПустаяСсылка)
	        |				ТОГДА 1
	        |			ИНАЧЕ 2
	        |		КОНЕЦ КАК Уровень,
	        |		0 КАК Порядок,
	        |		ЛОЖЬ КАК Обработано,
	        |		НомерСтроки КАК НомерСтроки,
	        |		ТипСтрокиСостава КАК ТипСтрокиСостава,
	        |		Номенклатура КАК Номенклатура,
	        |		Номенклатура.Артикул КАК Артикул,
	        |		Номенклатура.Штрихкод КАК Штрихкод,
	        |		Характеристика КАК Характеристика,
	        |		ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	        |		ВЫБОР
	        |			КОГДА Спецификации.Состав.ЕдиницаИзмерения ССЫЛКА Справочник.ЕдиницыИзмерения
	        |				ТОГДА Спецификации.Состав.ЕдиницаИзмерения.Коэффициент
	        |			ИНАЧЕ 1
	        |		КОНЕЦ КАК Коэффициент,
	        |		Спецификация КАК Спецификация,
	        |		Количество КАК Количество,
	        |		КоличествоПродукции КАК КоличествоПродукции,
	        |		ВЫБОР
	        |			КОГДА Спецификации.ВидПроизводства = ЗНАЧЕНИЕ(Справочник.ВидыПроизводства.ПустаяСсылка)
	        |				ТОГДА ЗНАЧЕНИЕ(Справочник.ЭтапыПроизводства.ПустаяСсылка)
	        |			ИНАЧЕ Спецификации.Состав.Этап
	        |		КОНЕЦ КАК Этап,
	        |		ФормулаНоменклатура КАК ФормулаНоменклатура,
	        |		ФормулаКоличество КАК ФормулаКоличество,
	        |		ИспользуетсяСопоставление КАК ИспользуетсяСопоставление,
	        |		Описание КАК Описание
	        |	) КАК Состав,
	        |	Спецификации.Операции.(
	        |		0 КАК Порядок,
	        |		НомерСтроки КАК НомерСтроки,
	        |		Операция КАК Операция,
	        |		НормаВремени КАК НормаВремени,
	        |		Количество КАК Количество,
	        |		КоличествоПродукции КАК КоличествоПродукции,
	        |		ВЫБОР
	        |			КОГДА Спецификации.ВидПроизводства = ЗНАЧЕНИЕ(Справочник.ВидыПроизводства.ПустаяСсылка)
	        |				ТОГДА ЗНАЧЕНИЕ(Справочник.ЭтапыПроизводства.ПустаяСсылка)
	        |			ИНАЧЕ Спецификации.Операции.Этап
	        |		КОНЕЦ КАК Этап,
	        |		ФормулаОперация КАК ФормулаОперация,
	        |		ФормулаКоличество КАК ФормулаКоличество,
	        |		ФормулаНормаВремени КАК ФормулаНормаВремени,
	        |		ИспользуетсяСопоставление КАК ИспользуетсяСопоставление,
	        |		Описание КАК Описание
	        |	) КАК Операции,
	        |	Спецификации.ВидПроизводства КАК ВидПроизводства,
	        |	Спецификации.ВидПроизводства.Этапы.(
	        |		НомерСтроки КАК НомерСтроки,
	        |		Этап КАК Этап
	        |	) КАК Этапы,
	        |	ЕСТЬNULL(Спецификации.Заказ.Контрагент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) КАК Контрагент
	        |ИЗ
	        |	Справочник.Спецификации КАК Спецификации
	        |ГДЕ
	        |	Спецификации.Ссылка В(&МассивОбъектов)";
	
КонецФункции

Процедура ВывестиЗаголовок(ТабличныйДокумент, Макет, ДанныеПечати)
		
	ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
	ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
	ТабличныйДокумент.Вывести(ОбластьМакета);
 
КонецПроцедуры

Процедура ВывестиЗаказ(ТабличныйДокумент, Макет, ДанныеПечати)
		
	ОбластьМакета = Макет.ПолучитьОбласть("Заказ");
	ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
	ТабличныйДокумент.Вывести(ОбластьМакета);
 
КонецПроцедуры

Процедура ВывестиТаблицу(ТаблицаДанных, ТабличныйДокумент, Макет, ТипОбласти)
		
	Если ТаблицаДанных.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	КоличествоПродукцииЗаполнено = Ложь;
	ВывестиШапку(ТаблицаДанных, ТабличныйДокумент, Макет, "Шапка" + ТипОбласти, КоличествоПродукцииЗаполнено);
	ТабличныйДокумент.НачатьАвтогруппировкуСтрок();
	
	Этап = Неопределено;
	Для каждого СтрокаСостава Из ТаблицаДанных Цикл
		ВывестиЭтап(СтрокаСостава, Этап, ТабличныйДокумент, Макет, "Этап" + ТипОбласти, КоличествоПродукцииЗаполнено);
		ВывестиСтроку(СтрокаСостава, Этап, ТабличныйДокумент, Макет, "Строка" + ТипОбласти, КоличествоПродукцииЗаполнено);
	КонецЦикла; 
	
	ТабличныйДокумент.ЗакончитьАвтогруппировкуСтрок();
	ВывестиКонецТаблицы(ТабличныйДокумент, Макет, КоличествоПродукцииЗаполнено);
		
КонецПроцедуры

Процедура ВывестиШапку(ТаблицаДанных, ТабличныйДокумент, Макет, ИмяОбласти, КоличествоПродукцииЗаполнено)
	
	ЕстьЭтапы = Ложь;
	Для каждого СтрокаТаблицы Из ТаблицаДанных Цикл
		Если СтрокаТаблицы.КоличествоПродукции <> 1 И СтрокаТаблицы.КоличествоПродукции <> 0 Тогда
			КоличествоПродукцииЗаполнено = Истина;
		КонецЕсли; 
		Если ЗначениеЗаполнено(СтрокаТаблицы.Этап) Тогда
			ЕстьЭтапы = Истина;
		КонецЕсли; 
	КонецЦикла; 
	ОбластьМакета = Макет.ПолучитьОбласть(ИмяОбласти + "|Основа");
	ДанныеЗаполнения = Новый Структура;
	Если ЕстьЭтапы Тогда
		ДанныеЗаполнения.Вставить("ЭтапСоставЗаголовок", НСтр("ru = 'Этап / Состав'"));
	Иначе
		ДанныеЗаполнения.Вставить("ЭтапСоставЗаголовок", НСтр("ru = 'Состав'"));
	КонецЕсли;
	ОбластьМакета.Параметры.Заполнить(ДанныеЗаполнения);
	ТабличныйДокумент.Вывести(ОбластьМакета);
	Если КоличествоПродукцииЗаполнено Тогда
		ОбластьМакета = Макет.ПолучитьОбласть(ИмяОбласти + "|КоличествоПродукции");
		ТабличныйДокумент.Присоединить(ОбластьМакета);
	КонецЕсли; 
	ОбластьМакета = Макет.ПолучитьОбласть(ИмяОбласти + "|КонецСтроки");
	ТабличныйДокумент.Присоединить(ОбластьМакета);
			
КонецПроцедуры

Процедура ВывестиЭтап(СтрокаТаблицы, Этап, ТабличныйДокумент, Макет, ИмяОбласти, КоличествоПродукцииЗаполнено)
		
	Если ЗначениеЗаполнено(СтрокаТаблицы.Этап) И Этап <> СтрокаТаблицы.Этап Тогда
		Этап = СтрокаТаблицы.Этап;
		ОбластьМакета = Макет.ПолучитьОбласть(ИмяОбласти + "|Основа");
		ОбластьМакета.Параметры.Заполнить(СтрокаТаблицы);
		ТабличныйДокумент.Вывести(ОбластьМакета, 1);
		Если КоличествоПродукцииЗаполнено Тогда
			ОбластьМакета = Макет.ПолучитьОбласть(ИмяОбласти + "|КоличествоПродукции");
			ТабличныйДокумент.Присоединить(ОбластьМакета, 1);
		КонецЕсли; 
		ОбластьМакета = Макет.ПолучитьОбласть(ИмяОбласти + "|КонецСтроки");
		ТабличныйДокумент.Присоединить(ОбластьМакета, 1);
	КонецЕсли;
	
КонецПроцедуры

Процедура ВывестиСтроку(СтрокаТаблицы, Этап, ТабличныйДокумент, Макет, ИмяОбласти, КоличествоПродукцииЗаполнено)
	
	ДанныеПечати = Новый Структура;
	Если ИмяОбласти = "СтрокаСостав" Тогда
		ЗаполнитьДанныеПечатиПоСтрокеТабличнойЧастиСостав(СтрокаТаблицы, ДанныеПечати);
	ИначеЕсли ИмяОбласти = "СтрокаОперации" Тогда
		ЗаполнитьДанныеПечатиПоСтрокеТабличнойЧастиОперации(СтрокаТаблицы, ДанныеПечати);
	КонецЕсли; 
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаТаблицы, "Уровень") Тогда
		Уровень = СтрокаТаблицы.Уровень;
	ИначеЕсли ЗначениеЗаполнено(Этап) Тогда 
		Уровень = 2;
	Иначе
		Уровень = 1;
	КонецЕсли; 
	ОбластьМакета = Макет.ПолучитьОбласть(ИмяОбласти + "|Основа");
	ОбластьМакета.Параметры.Заполнить(СтрокаТаблицы);
	ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
	ТабличныйДокумент.Вывести(ОбластьМакета, Уровень);
	Если КоличествоПродукцииЗаполнено Тогда
		ОбластьМакета = Макет.ПолучитьОбласть(ИмяОбласти + "|КоличествоПродукции");
		ОбластьМакета.Параметры.Заполнить(СтрокаТаблицы);
		ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
		ТабличныйДокумент.Присоединить(ОбластьМакета, Уровень);
	КонецЕсли; 
	ОбластьМакета = Макет.ПолучитьОбласть(ИмяОбласти + "|КонецСтроки");
	ТабличныйДокумент.Присоединить(ОбластьМакета, Уровень);
	
КонецПроцедуры

Процедура ВывестиКонецТаблицы(ТабличныйДокумент, Макет, КоличествоПродукцииЗаполнено)
		
	ОбластьМакета = Макет.ПолучитьОбласть("КонецТаблицы|Основа");
	ТабличныйДокумент.Вывести(ОбластьМакета);
	Если КоличествоПродукцииЗаполнено Тогда
		ОбластьМакета = Макет.ПолучитьОбласть("КонецТаблицы|КоличествоПродукции");
		ТабличныйДокумент.Присоединить(ОбластьМакета);
	КонецЕсли;
	
КонецПроцедуры

Процедура ВывестиПодписи(ТабличныйДокумент, Макет)
		
	ОбластьМакета = Макет.ПолучитьОбласть("Подписи");
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
КонецПроцедуры

Процедура ЗаполнитьДанныеПечатиПоСтрокеТабличнойЧастиСостав(СтрокаТабличнойЧасти, ДанныеПечати)
	
	ДанныеПечати.Очистить();
	ПараметрыНоменклатуры = Новый Структура;
	
	ПараметрыНоменклатуры.Вставить("ПредставлениеНоменклатуры", СтрокаТабличнойЧасти.Номенклатура);
	ПараметрыНоменклатуры.Вставить("ПредставлениеХарактеристики", СтрокаТабличнойЧасти.Характеристика);
	ПараметрыНоменклатуры.Вставить("ПредставлениеАртикула", СтрокаТабличнойЧасти.Артикул);
	
	Если СтрокаТабличнойЧасти.ИспользуетсяСопоставление Тогда
		Если ПустаяСтрока(СтрокаТабличнойЧасти.Описание) Тогда
			Описание = "";
		Иначе
			Описание = СтрШаблон(": %1", СтрокаТабличнойЧасти.Описание);
		КонецЕсли; 
		ДанныеПечати.Вставить("ПредставлениеНоменклатуры", СтрШаблон(НСтр("ru = '<Сопоставление%1>'"), Описание));
		ДанныеПечати.Вставить("ЕдиницаИзмерения", "-");
	ИначеЕсли НЕ ПустаяСтрока(СтрокаТабличнойЧасти.ФормулаНоменклатура) Тогда
		ДанныеПечати.Вставить("ПредставлениеНоменклатуры", НСтр("ru = '<Формула>'"));
		ДанныеПечати.Вставить("ЕдиницаИзмерения", "-");
	Иначе
		ДанныеПечати.Вставить("ПредставлениеНоменклатуры", ПечатьДокументовУНФ.ПредставлениеНоменклатуры(ПараметрыНоменклатуры));
	КонецЕсли;

	Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.ТипСтрокиСостава) 
		И СтрокаТабличнойЧасти.ТипСтрокиСостава <> Перечисления.ТипыСтрокСоставаСпецификации.Материал Тогда
		ДанныеПечати.Вставить("ПредставлениеНоменклатуры", 
			СтрШаблон("%1, %2", ДанныеПечати.ПредставлениеНоменклатуры, СтрокаТабличнойЧасти.ТипСтрокиСостава));
	КонецЕсли; 
	
	Если НЕ ПустаяСтрока(СтрокаТабличнойЧасти.ФормулаКоличество) Тогда
		ДанныеПечати.Вставить("Количество", НСтр("ru = '<Формула>'"));
	КонецЕсли; 
	
КонецПроцедуры

Процедура ЗаполнитьДанныеПечатиПоСтрокеТабличнойЧастиОперации(СтрокаТабличнойЧасти, ДанныеПечати)
	
	ДанныеПечати.Очистить();
	ПараметрыНоменклатуры = Новый Структура;
	
	ПараметрыНоменклатуры.Вставить("ПредставлениеНоменклатуры", СтрокаТабличнойЧасти.Операция);
	
	Если СтрокаТабличнойЧасти.ИспользуетсяСопоставление Тогда
		Если НЕ ПустаяСтрока(СтрокаТабличнойЧасти.Описание) Тогда
			Описание = "";
		Иначе
			Описание = СтрШаблон(": %1", СтрокаТабличнойЧасти.Описание);
		КонецЕсли; 
		ДанныеПечати.Вставить("ПредставлениеНоменклатуры", СтрШаблон(НСтр("ru = '<Сопоставление%1>'"), Описание));
	ИначеЕсли НЕ ПустаяСтрока(СтрокаТабличнойЧасти.ФормулаОперация) Тогда
		ДанныеПечати.Вставить("ПредставлениеНоменклатуры", НСтр("ru = '<Формула>'"));
	Иначе
		ДанныеПечати.Вставить("ПредставлениеНоменклатуры", ПечатьДокументовУНФ.ПредставлениеНоменклатуры(ПараметрыНоменклатуры));
	КонецЕсли;

	Если НЕ ПустаяСтрока(СтрокаТабличнойЧасти.ФормулаКоличество) Тогда
		ДанныеПечати.Вставить("Количество", НСтр("ru = '<Формула>'"));
	КонецЕсли; 
	
	Если НЕ ПустаяСтрока(СтрокаТабличнойЧасти.ФормулаНормаВремени) Тогда
		ДанныеПечати.Вставить("НормаВремени", НСтр("ru = '<Формула>'"));
	КонецЕсли; 
	
КонецПроцедуры

Процедура РазвернутьСпецификации(ДанныеСпецификации)
	
	РазворачиваемыеСпецификации = ПустаяТаблицаРазворачиваемыхСпецификаций();
	Итерация = 0;
	Пока Итерация < МаксимальноеКоличествоИтераций() И ЕстьСпецификации(ДанныеСпецификации.Состав) Цикл
		Итерация = Итерация + 1;
		РазворачиваемыеСпецификации.Очистить();
		Для каждого СтрокаСостава Из ДанныеСпецификации.Состав Цикл
			Если НЕ ЗначениеЗаполнено(СтрокаСостава.Спецификация) ИЛИ СтрокаСостава.Обработано Тогда
				Продолжить;
			КонецЕсли;
			НоваяСтрока = РазворачиваемыеСпецификации.Добавить();
			НоваяСтрока.Спецификация = СтрокаСостава.Спецификация;
			НоваяСтрока.Индекс = ДанныеСпецификации.Состав.Индекс(СтрокаСостава);
			НоваяСтрока.Уровень = СтрокаСостава.Уровень;
			НоваяСтрока.Этап = СтрокаСостава.Этап;
			НоваяСтрока.Количество = СтрокаСостава.Количество * СтрокаСостава.Коэффициент;
		КонецЦикла;
		СоставИОперации = СоставИОперации(РазворачиваемыеСпецификации);
		Для каждого СтрокаСостава Из СоставИОперации.Состав Цикл
			РазворачиваемаяСтрока = ДанныеСпецификации.Состав[СтрокаСостава.Индекс];
			Если НЕ РазворачиваемаяСтрока.Обработано Тогда
				РазворачиваемаяСтрока.Обработано = Истина;
			КонецЕсли; 
			Если СтрокаСостава.Индекс >= ДанныеСпецификации.Состав.Количество() - 1 Тогда
				НоваяСтрока = ДанныеСпецификации.Состав.Добавить();
			Иначе
				НоваяСтрока = ДанныеСпецификации.Состав.Вставить(СтрокаСостава.Индекс + 1);
			КонецЕсли; 
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаСостава);
		КонецЦикла;
		Для каждого СтрокаОперации Из СоставИОперации.Операции Цикл
			НоваяСтрока = ДанныеСпецификации.Операции.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаОперации);
		КонецЦикла; 
	КонецЦикла;
	
	ПронумероватьТаблицу(ДанныеСпецификации.Состав);
	ПронумероватьТаблицу(ДанныеСпецификации.Операции);
	
	Если Итерация >= МаксимальноеКоличествоИтераций() Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Превышено максимальное значение вложенных спецификаций, печать невозможна'"));
		ДанныеСпецификации.Состав.Очистить();
		ДанныеСпецификации.Операции.Очистить();
	КонецЕсли; 
	
КонецПроцедуры

Функция ПустаяТаблицаРазворачиваемыхСпецификаций()
		
	РазворачиваемыеСпецификации = Новый ТаблицаЗначений;
	РазворачиваемыеСпецификации.Колонки.Добавить("Спецификация", Новый ОписаниеТипов("СправочникСсылка.Спецификации"));
	РазворачиваемыеСпецификации.Колонки.Добавить("Индекс", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 0)));
	РазворачиваемыеСпецификации.Колонки.Добавить("Уровень", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(2, 0)));
	РазворачиваемыеСпецификации.Колонки.Добавить("Этап", Новый ОписаниеТипов("СправочникСсылка.ЭтапыПроизводства"));
	РазворачиваемыеСпецификации.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3)));
	Возврат РазворачиваемыеСпецификации;
	
КонецФункции
 
Функция МаксимальноеКоличествоИтераций()
	
	Возврат 50;
	
КонецФункции

Функция ЕстьСпецификации(ТаблицаСостава)
	
	Для каждого СтрокаСостава Из ТаблицаСостава Цикл
		Если ЗначениеЗаполнено(СтрокаСостава.Спецификация) И НЕ СтрокаСостава.Обработано Тогда
			Возврат Истина;
		КонецЕсли; 
	КонецЦикла; 
	Возврат Ложь;
	
КонецФункции

Функция СоставИОперации(РазворачиваемыеСпецификации)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("РазворачиваемыеСпецификации", РазворачиваемыеСпецификации);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РазворачиваемыеСпецификации.Спецификация КАК Спецификация,
	|	РазворачиваемыеСпецификации.Индекс КАК Индекс,
	|	РазворачиваемыеСпецификации.Уровень КАК Уровень,
	|	РазворачиваемыеСпецификации.Этап КАК Этап,
	|	РазворачиваемыеСпецификации.Количество КАК Количество
	|ПОМЕСТИТЬ РазворачиваемыеСпецификации
	|ИЗ
	|	&РазворачиваемыеСпецификации КАК РазворачиваемыеСпецификации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЛОЖЬ КАК Обработано,
	|	РазворачиваемыеСпецификации.Индекс КАК Индекс,
	|	РазворачиваемыеСпецификации.Уровень + 1 КАК Уровень,
	|	РазворачиваемыеСпецификации.Этап КАК Этап,
	|	СпецификацииСостав.НомерСтроки КАК НомерСтроки,
	|	СпецификацииСостав.ТипСтрокиСостава КАК ТипСтрокиСостава,
	|	СпецификацииСостав.Номенклатура КАК Номенклатура,
	|	СпецификацииСостав.Номенклатура.Артикул КАК Артикул,
	|	СпецификацииСостав.Номенклатура.Штрихкод КАК Штрихкод,
	|	СпецификацииСостав.Характеристика КАК Характеристика,
	|	СпецификацииСостав.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	СпецификацииСостав.Спецификация КАК Спецификация,
	|	СпецификацииСостав.Количество * РазворачиваемыеСпецификации.Количество КАК Количество,
	|	ВЫБОР
	|		КОГДА СпецификацииСостав.ЕдиницаИзмерения ССЫЛКА Справочник.ЕдиницыИзмерения
	|			ТОГДА СпецификацииСостав.ЕдиницаИзмерения.Коэффициент
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК Коэффициент,
	|	СпецификацииСостав.КоличествоПродукции КАК КоличествоПродукции,
	|	СпецификацииСостав.ФормулаНоменклатура КАК ФормулаНоменклатура,
	|	СпецификацииСостав.ФормулаКоличество КАК ФормулаКоличество,
	|	СпецификацииСостав.ИспользуетсяСопоставление КАК ИспользуетсяСопоставление,
	|	СпецификацииСостав.Описание КАК Описание
	|ИЗ
	|	РазворачиваемыеСпецификации КАК РазворачиваемыеСпецификации
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Спецификации.Состав КАК СпецификацииСостав
	|		ПО РазворачиваемыеСпецификации.Спецификация = СпецификацииСостав.Ссылка
	|ГДЕ
	|	НЕ СпецификацииСостав.Номенклатура ЕСТЬ NULL
	|
	|УПОРЯДОЧИТЬ ПО
	|	Индекс УБЫВ,
	|	НомерСтроки УБЫВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РазворачиваемыеСпецификации.Индекс КАК Индекс,
	|	РазворачиваемыеСпецификации.Этап КАК Этап,
	|	СпецификацииОперации.НомерСтроки КАК НомерСтроки,
	|	СпецификацииОперации.Операция КАК Операция,
	|	СпецификацииОперации.НормаВремени КАК НормаВремени,
	|	СпецификацииОперации.Количество * РазворачиваемыеСпецификации.Количество КАК Количество,
	|	СпецификацииОперации.КоличествоПродукции КАК КоличествоПродукции,
	|	СпецификацииОперации.ФормулаОперация КАК ФормулаОперация,
	|	СпецификацииОперации.ФормулаКоличество КАК ФормулаКоличество,
	|	СпецификацииОперации.ФормулаНормаВремени КАК ФормулаНормаВремени,
	|	СпецификацииОперации.ИспользуетсяСопоставление КАК ИспользуетсяСопоставление,
	|	СпецификацииОперации.Описание КАК Описание
	|ИЗ
	|	РазворачиваемыеСпецификации КАК РазворачиваемыеСпецификации
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Спецификации.Операции КАК СпецификацииОперации
	|		ПО РазворачиваемыеСпецификации.Спецификация = СпецификацииОперации.Ссылка
	|ГДЕ
	|	НЕ СпецификацииОперации.Операция ЕСТЬ NULL
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	Результат = Новый Структура;
	Результат.Вставить("Состав", РезультатЗапроса[1].Выгрузить());
	Результат.Вставить("Операции", РезультатЗапроса[2].Выгрузить());
	Возврат Результат;
	
КонецФункции

Процедура ПронумероватьТаблицу(Таблица)
	
	НомерСтроки = 1;
	Для каждого СтрокаТаблицы Из Таблица Цикл
		СтрокаТаблицы.НомерСтроки = НомерСтроки;
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла; 
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти 

#КонецЕсли
